1D_flame_with_parcel/Stoichiometric/Openfoam_solution-stoich-coarse/constant/CloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      cloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type        collidingCloud;

libs ("liblagrangianParcelPoliMi.so");

solution
{
    coupled         false;
    transient       yes;
    cellValueSourceCorrection off;
    maxCo           0.3;

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
    }

    integrationSchemes
    {
        U               Euler;
    }
}

constantProperties
{
    rho0            0.8;
    youngsModulus   6e8;
    poissonsRatio   0.35;
}

subModels
{
    particleForces
    {
        sphereDrag;
    }

    injectionModels
    {
        air
        {
            type            manualInjectionExtended;
            nParticle       1;
            SOI             0.01;
            positionsFile   "particlePosition.txt";
            U0              (0 0 0);
            sizeDistribution
            {
                type        fixedValue;
                value       1.2e-4;//[m]
            }
            
            repeatedInjection true;
            duration          1;  //[s]
            injectEvery       5e-4;//[s]
        }
    }

    dispersionModel none;

    patchInteractionModel standardWallInteraction;
    
    standardWallInteractionCoeffs
    {
        type rebound;
    }

    surfaceFilmModel none;

    stochasticCollisionModel none;

    collisionModel none;
}


cloudFunctions
{}


// ************************************************************************* //
