1D_flame_with_parcel/Stoichiometric/Openfoam_solution-stoich-coarse/constant/particlePosition.txt
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
    (0.0 0.0005 0.0005)
);
